In [17]:
import pandas as pd
import numpy as np

In [18]:
df = pd.read_csv("titanic dataset.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [20]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [21]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [22]:
del df["Name"]

In [23]:
del df["Ticket"]
del df["Fare"]
del df["Cabin"]

In [24]:
df.head()

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch Embarked
0            1         0       3    male  22.0      1      0        S
1            2         1       1  female  38.0      1      0        C
2            3         1       3  female  26.0      0      0        S
3            4         1       1  female  35.0      1      0        S
4            5         0       3    male  35.0      0      0        S

In [25]:
#changing value of male to 1 and female to 2


def getNumber(str):
    if str == "male":
        return 1
    if str == "female":
        return 2


df["Gender"] = df.Sex.apply(getNumber)
df.head()

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch Embarked  Gender
0            1         0       3    male  22.0      1      0        S       1
1            2         1       1  female  38.0      1      0        C       2
2            3         1       3  female  26.0      0      0        S       2
3            4         1       1  female  35.0      1      0        S       2
4            5         0       3    male  35.0      0      0        S       1

In [26]:
del df["Sex"]

In [27]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Age            177
SibSp            0
Parch            0
Embarked         2
Gender           0
dtype: int64

In [ ]:
mean_survived = df[df.Survived == 1].Age.mean()
mean_dead = df[df.Survived == 0].Age.mean()

(np.float64(28.343689655172415), np.float64(30.62617924528302))

In [35]:
df[pd.isnull(df.Age) & df.Survived ==1].head(20)

     PassengerId  Survived  Pclass  Age  SibSp  Parch Embarked  Gender
17            18         1       2  NaN      0      0        S       1
19            20         1       3  NaN      0      0        C       2
28            29         1       3  NaN      0      0        Q       2
31            32         1       1  NaN      1      0        C       2
32            33         1       3  NaN      0      0        Q       2
36            37         1       3  NaN      0      0        C       1
47            48         1       3  NaN      0      0        Q       2
55            56         1       1  NaN      0      0        S       1
65            66         1       3  NaN      1      1        C       1
82            83         1       3  NaN      0      0        Q       2
107          108         1       3  NaN      0      0        S       1
109          110         1       3  NaN      1      0        Q       2
128          129         1       3  NaN      1      1        C       2
166          167         1       1  NaN      0      1        S       2
186          187         1       3  NaN      1      0        Q       2
198          199         1       3  NaN      0      0        Q       2
241          242         1       3  NaN      1      0        Q       2
256          257         1       1  NaN      0      0        C       2
274          275         1       3  NaN      0      0        Q       2
298          299         1       1  NaN      0      0        S       1

In [36]:
df[pd.isnull(df.Age) & df.Survived ==0].head(20)

    PassengerId  Survived  Pclass   Age  SibSp  Parch Embarked  Gender
0             1         0       3  22.0      1      0        S       1
1             2         1       1  38.0      1      0        C       2
2             3         1       3  26.0      0      0        S       2
3             4         1       1  35.0      1      0        S       2
4             5         0       3  35.0      0      0        S       1
5             6         0       3   NaN      0      0        Q       1
6             7         0       1  54.0      0      0        S       1
7             8         0       3   2.0      3      1        S       1
8             9         1       3  27.0      0      2        S       2
9            10         1       2  14.0      1      0        C       2
10           11         1       3   4.0      1      1        S       2
11           12         1       1  58.0      0      0        S       2
12           13         0       3  20.0      0      0        S       1
13           14         0       3  39.0      1      5        S       1
14           15         0       3  14.0      0      0        S       2
15           16         1       2  55.0      0      0        S       2
16           17         0       3   2.0      4      1        Q       1
18           19         0       3  31.0      1      0        S       2
20           21         0       2  35.0      0      0        S       1
21           22         1       2  34.0      0      0        S       1

In [ ]:
df = np.where(pd.isnull(df.Age) & df.Survived == 1, mean_survived, df.Age)